# 将数据使用c()函数赋予X
X<-c(4.13,4.07,4.04,4.07,4.05,4.04,4.02,4.06,4.10,4.04,
     3.86,3.85,4.08,4.11,4.08,4.01,4.02,4.04,3.97,3.95,
     4.00,4.02,4.01,4.01,4.04,3.99,4.03,3.97,3.98,3.98,
     3.88,3.88,3.91,3.95,3.92,3.97,3.92,3.90,3.97,3.90,
     4.02,3.95,4.02,3.89,3.91,4.01,3.89,3.89,3.99,4.00,
     4.02,3.86,3.96,3.97,4.00,3.82,3.98,3.99,4.02,3.93,
     4.00,4.02,4.03,4.04,4.10,3.81,3.91,3.96,4.05,4.06)
# 将数据分为7组，每组10个数据
A<-factor(rep(1:7,each=10))
# 将X和A构成一个数据框赋予contents
contents<-data.frame(X,A)
# 对contents作方差分析（analysis of variance），结果赋予aov.cont
aov.cont<-aov(X~A,data=contents)
# 输出结果
res<-summary(aov.cont)
print(res)
# 绘制箱线图
boxplot(X~A)
